{"schema":6,"addons":[{"id":"{60f82f00-9ad5-4de5-b31c-b16a47c51558}","icons":{"32":"https://addons.mozilla.org/user-media/addon_icons/905/905349-32.png?modified=mcrushed","64":"https://addons.mozilla.org/user-media/addon_icons/905/905349-64.png?modified=mcrushed","128":"https://addons.mozilla.org/user-media/addon_icons/905/905349-128.png?modified=mcrushed"},"name":"Cookie Quick Manager","version":"0.5rc2","sourceURI":"https://addons.mozilla.org/firefox/downloads/file/3343599/cookie_quick_manager-0.5rc2.xpi","homepageURL":"https://github.com/ysard/cookie-quick-manager","supportURL":"https://github.com/ysard/cookie-quick-manager/issues","description":"Un gestionnaire de cookies pour les visualiser, les rechercher, les éditer, les ajouter, les supprimer, les sauvegarder ou les restaurer et bien plus. Firefox 57+ est supporté.","fullDescription":"Présentation\n\nCookie Quick Manager : Un gestionnaire complet pour les cookies créés en cours de navigation.\nIl permet notamment de visualiser, éditer, créer, supprimer, sauvegarder, restaurer, protéger et rechercher les cookies par noms de domaines. Les contextes de navigation tels que la navigation privée, l'isolement de la première partie, le flag SameSite sont également supportés.\nDe plus, le localstorage de la page consultée peut être effacé (voir en dessous).\n\nCookie Quick Manager est destiné aux développeurs, aux testeurs ou aux personnes soucieuses du respect de leur vie privée sur Internet.\n\nCette WebExtension est compatible avec Firefox 57 et s'inspire des addons Cookies Manager+ et Advanced Cookie Manager dont le développement a été arrêté à cause de l'abandon du support des extensions \"Legacy\".\n\nNovembre 2018: Cookie Quick Manager est maintenant disponible sur Android !\n\nFonctionnalités\n\n    Ergonomie : Interface structurée. Chaque paramètre ou fonctionnalité est décrit au survol de la souris.\n    Modes fenêtré et onglet : Choisissez l'ouverture dans un onglet pour bénéficier d'une vue plus large.\n    Transparence et sécurité : Le code source est libre (sous licence GPLv3) et publié sur une plateforme publique, seul moyen autorisant les relectures et les contributions externes.\n    Recherche : Un utilisateur peut rechercher les cookies d'un domaine et des sous-domaines qui en dépendent.\n    Édition/Création : Tous les attributs d'un cookie peuvent être modifiés : domaine, chemin, nom, valeur, date d'expiration ainsi que les flags secure et httponly.\n    Suppression : Autorise la suppression des cookies de n'importe quel site consulté en deux clics.\n    Export : L'exportation et l'importation d'un ou de plusieurs cookies provenant d'un ou plusieurs domaines au format JSON ou Netscape est tout aussi facile.\n    Isolement de la première partie (First-Party Isolation) : Supporté avec limitations (dues à des bugs de l'API) pour Firefox 59, 60 et 61; et supporté sans limitations à partir de Firefox 62 (prévue pour septembre 2018).\n    Contextes de navigation/containers : Les contextes de navigation (aussi appelés Multi-Account Containers, ou Contextual Identities) sont supportés. Un utilisateur peut par exemple chercher et afficher les cookies d'un contexte, ou encore copier des cookies d'un contexte vers un autre, ou bien sauvegarder un cookie dans un contexte spécifique.\n    SameSite : Le flag SameSite est supporté. Il s'agit d'une protection partielle contre les risques liés aux attaques de type CSRF (Cross-Site Request Forgery) et XSSI (Cross-Site Script Inclusion), implémentée depuis Firefox 63.\n    Protection des cookies : Supression des cookies non protégés en deux clics, depuis la page consultée. Une option peut également empêcher la suppression de cookies par les sites eux-mêmes.\n    Protection des cookies de session : Les cookies de session peuvent être protégés en deux clics afin d'empêcher une déconnexion accidentelle des sites consultés.\n    Nettoyage et vie privée : Suppression automatique possible des cookies au démarrage du navigateur.\n    LocalStorage: Les clés/valeurs de la page consultée peuvent être effacées en un clic.\n\n\n\nVie privée & droits\n\nCet addon ne stocke et ne fait fuiter aucune information personnelle.\n\nIl requiert les droits suivants pour fonctionner :\n\n    Host permission for all urls : Cela permet d'éditer les cookies et de supprimer le LocalStorage de n'importe quel site consulté.\n    Cookies : Autorise l'accès à la base de données des cookies du navigateur.\n    ActiveTab : Autorise l'accès à l'url consultée ainsi qu'à sa favicon si elle existe.\n    Storage : Autorise le stockage des paramètres utilisateur suivants :\n    - dimensions de la fenêtre,\n    - la liste des noms de domaines possédant un cookie protégé par l'addon,\n    - le template d'exportation choisi (JSON/Netscape),\n    - le thème graphique utilisé.\n    Browsing data : Autorise l'addon à effacer les données accumulées lors de la navigation (la base de données LocalStorage ici).\n    Contextual Identities : Autorise l'addon à lister les contextes de navigation.\n    Privacy : Autorise l'accès et la modification de paramètres liés à la vie privée (gestion de l'option FirstPartyIsolation).\n    ClipboardWrite (optionel) : Autorise l'export des cookies dans le presse-papier à partir de Firefox 63.\n\n\n\nÀ propos de la protection des cookies\n\nLa protection des cookies est limitée aux actions de l'addon, aux suppressions automatiques réalisées par les sites eux-mêmes, ou aux suppressions réalisées dans la section \"Cookies et données de sites\" des préférences du navigateur. Cela veut dire que l'option de suppression des cookies à la fermeture du navigateur, intégrée à Firefox est incompatible. Néanmoins, cette option est réimplémentée dans cet addon dans le but de pouvoir conserver seulement les cookies protégés au démarrage du navigateur.\n\n\nQu'est-ce que \"Supprimer le LocalStorage de la page\" dans le menu contextuel ?\n\nCet élément permet à un utilisateur de supprimer les clés LocalStorage de la page affichée.\n\nLocalStorage est une fonctionnalité assez récente de HTML5 qui permet aux développeurs de créer des données dans votre navigateur en utilisant JavaScript. Les cookies ne sont qu'un type de stockage, parmi d'autres.\n\nVous trouverez également le terme \"SessionStorage\", un LocalStorage où les données sont stockées temporairement (supprimées au redémarrage du navigateur); l'important est que LocalStorage est persistant et effacé uniquement à la discrétion des sites Web visités.\nVous pouvez effacer tout le magasin LocalStorage en suivant la procédure décrite dans la documentation de Firefox, et en sélectionnant \"Données de site hors ligne\".\n\nDu point de vue de la vie privée et de la sécurité:\n\nCe type de données persistantes (même après la suppression du cache) a été inventé pour stocker de petites informations permettant le fonctionnement d’applications en ligne, mais permet également la mise en place de nouvelles méthodes précises de suivi grâce à la mémorisation de données privées ou d'identification.\n\n\nSupport & code source\n\nL'extension est toujours en développement avec l'arrivée de Firefox Quantum; les questions, rapports de bugs et demandes de fonctionnalités sont ouvertes sur le dépôt GitHub (Anglais).\n\n\nLicence\n\nGPLv3.","weeklyDownloads":4632,"type":"extension","creator":{"name":"Ysard","url":"https://addons.mozilla.org/fr/firefox/user/13597965/"},"developers":[],"screenshots":[{"url":"https://addons.mozilla.org/user-media/previews/full/211/211222.png?modified=1622132873","width":293,"height":170,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211222.jpg?modified=1622132873","thumbnailWidth":293,"thumbnailHeight":170,"caption":"Menu contextuel sur Firefox. Supprimez les cookies, sauf ceux protégés, en 2 clics à tout moment sur le site Web que vous consultez."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211223.png?modified=1622132875","width":1093,"height":593,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211223.jpg?modified=1622132875","thumbnailWidth":533,"thumbnailHeight":289,"caption":"Vue globale du mode fenêtré, avec menu contextuel au-dessus de la liste des domaines. La navigation privée et les contextes de navigation sont pris en charge. Les badges permettent de voir rapidement l'appartenance des cookies à leur conteneur."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211224.png?modified=1622132875","width":458,"height":212,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211224.jpg?modified=1622132875","thumbnailWidth":458,"thumbnailHeight":212,"caption":"En plus de la recherche simple basée sur les noms de sites, il est possible de rechercher du texte dans les noms et les valeurs de cookies."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211225.png?modified=1622132876","width":725,"height":308,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211225.jpg?modified=1622132876","thumbnailWidth":533,"thumbnailHeight":226,"caption":"Des fonctions rapidement accessibles permettent de traiter les données, ce qui aide à les rendre lisibles."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211226.png?modified=1622132877","width":421,"height":540,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211226.jpg?modified=1622132877","thumbnailWidth":312,"thumbnailHeight":400,"caption":"Modifiez facilement tous les attributs des cookies, tels que la date d'expiration."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211227.png?modified=1622132879","width":462,"height":540,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211227.jpg?modified=1622132879","thumbnailWidth":342,"thumbnailHeight":400,"caption":"Créez de nouveaux cookies en déverrouillant les champs de saisie."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211228.png?modified=1622132879","width":267,"height":163,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211228.jpg?modified=1622132879","thumbnailWidth":267,"thumbnailHeight":163,"caption":"Gérer finement la protection des cookies par l'application. Protégez les cookies de session en 1 clic et évitez les déconnexions inattendues après un effacement."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211229.png?modified=1622132880","width":306,"height":307,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211229.jpg?modified=1622132880","thumbnailWidth":306,"thumbnailHeight":307,"caption":"Exportez et restaurez facilement un ou plusieurs cookies. Les formats pris en charge sont le format JSON, similaire à l'ancien addon CookieManager+, et le format Netscape pour les outils GNU wget/curl."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211230.png?modified=1622132882","width":1202,"height":609,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211230.jpg?modified=1622132882","thumbnailWidth":533,"thumbnailHeight":270,"caption":"Un cookie au format JSON prêt à être exporté."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211231.png?modified=1622132883","width":659,"height":584,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211231.jpg?modified=1622132883","thumbnailWidth":451,"thumbnailHeight":400,"caption":"Gérez le comportement, l'apparence et les paramètres de l'extension."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211232.png?modified=1622132884","width":659,"height":584,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211232.jpg?modified=1622132884","thumbnailWidth":451,"thumbnailHeight":400,"caption":"Gérez vos cookies protégés en un clin d'œil et en quelques clics."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211233.png?modified=1622132886","width":540,"height":960,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211233.jpg?modified=1622132886","thumbnailWidth":225,"thumbnailHeight":400,"caption":"Cookie Quick Manager est aussi disponible sur Android et sur le matériel disposant d'écran de taille restreinte."},{"url":"https://addons.mozilla.org/user-media/previews/full/211/211234.png?modified=1622132887","width":540,"height":960,"thumbnailURL":"https://addons.mozilla.org/user-media/previews/thumbs/211/211234.jpg?modified=1622132887","thumbnailWidth":225,"thumbnailHeight":400,"caption":"Éditez vos cookies sur Android."}],"contributionURL":"https://liberapay.com/Ysard/donate?utm_content=product-page-contribute&utm_medium=referral&utm_source=addons.mozilla.org","averageRating":4.4156,"reviewCount":131,"reviewURL":"https://addons.mozilla.org/fr/firefox/addon/cookie-quick-manager/reviews/","updateDate":1562817623000}]}